import React from 'react'

class Rules extends React.Component {
    render() {
        return (
            <div className="rules_dark">
                <h1>Правила сервера!</h1>
                <ol>
                    <li>Быть уважительным к другим</li>
                    <li>Отправка / связывание любых вредоносных материалов, таких как вирусы, средства захвата IP или оборудование, приводит к немедленному и постоянному бану.</li>
                    <li>Спам запрещен, разрешен он только в канале #spam📮.</li>
                    <li>Запрещается чрезмерное использование крайне неуместной лексики.</li>
                    <li>Упоминание @everyone, модераторов  без причины запрещено.</li>
                    <li>Будьте вежливы в голосовых каналах.</li>
                    <li>Общайтесь на тему, подходящую под описание канала, в крайнем случае перейдите в #spam📮.</li>
                    <li>Не размещайте чью-либо личную информацию, рекламу без разрешения.</li>
                    <li>Слушайтесь модераторов и админов.</li>
                    <li>Не размещайте какие-либо NSFW изображения в неположенных местах, это приводит к немедленному бану.</li>
                    <li>Запрещено размещать рекламу без разрешения.</li>
                    <li>Если у вас появились вопросы, обратитесь в канале #help.</li>
                    <li>В текстовых каналах нет зацикленности общаться на каком-либо конкретном языке, пусть даже язык программирования.</li>
                    <li>Не ставить ники, оскорбляющие личность, или целое комьюнити, — в данном случае модераторы будут вынуждены поменять ваш никнейм.</li>
                    <li>Не ставить аватарки, связанные с NSFW контентом.</li>
                    <li>Не устраивайте ссоры и срачи (или вообще массовое гачимучи), приведенные вещи никак не связаны с сервером, поэтому, милости просим делать дела в другом месте.</li>
                </ol>
                <h3>Просим учесть тот факт, что правила будут меняться в зависимости от положения самого сервера.</h3>
            </div>
        )
    }
}

export default Rules